//#include<iostream>
//
//using namespace std;
//
//int main()
//{
//	//数组中的每个元素都是相同的数据类型
//	//数字是由连续内存位置组成的
//
//	/*数组的三种定义方式
//	* 1.数据类型 数组名[数据长度]
//	* 2.数据类型 数组名[数据长度] = {值1，值2，值3...}
//	* 3.数据类型 数组名[] = {值1，值2...}
//	*/
//	int arr[5]; // 定义元素个数
//
//	// 数组元素的下标是从0开始索引的
//	arr[0] = 10;
//	arr[1] = 20;
//	arr[2] = 30;
//	arr[3] = 40;
//	arr[4] = 50;
//
//	// 访问数组
//
//	//cout << arr[0] << endl;
//	//cout << arr[1] << endl;
//	//cout << arr[2] << endl;
//	//cout << arr[3] << endl;
//	//cout << arr[4] << endl;
//
//	int	arr2[5] = { 10,20,30,40,50 }; // 如果在初始化数据的时候，没有全部填写完，会用0填写后面的数据
//	for (int i = 0; i < 5; i++)
//	{
//		cout << arr2[i]<<endl;
//	}
//
//	int arr3[] = {10,20,30,40,50}
//
//	
//	
//
//	system("pause");
//	return 0;
//}